[
    {
        "title": "Whom Do I Tutor?",
        "statements": ["Electrical Apprentices: enrolled in trade school."]
    },
    {
        "title": "Who I am / Qualifications for this job?",
        "statements": ["Currently a 4th term apprentice in the IBEW, I finishing 3rd highest in my class with a 4.17 GPA; receiving Dean Honor's in all 3 levels."]
    },
    {
        "title": "How?",
        "statements": [
            "With first hand knowledge, I have found the most effective way to convey electrical theory is with visual teaching. To accomplish this a white board is used. ",
            "We will work on RLC circuit analysis, motor calculations, service calculations, etc. all benefiting from putting as much information down on paper in front of you."
        ]
    },
    {
        "title": "Why?",
        "statements": [
            "Going through trade school I found the best way for me to study was to tutoring fellow students. My thought was: 'If I am able to confidently help someone understand a concept or handle mathematical calculation with ease, then I was solid in my own understanding'. Through this process I received a ton of positive feedback from both the students as well as some of the instructors who witnessed some of my sessions; normally being with 1-4 other students and myself.",
            "Having experience attending trade school & tutoring other students I have gained a unique insight into where most people will get stuck and can easily pick up on the weak points you maybe having.",
            "Seeing the growing demand for skilled trades due to the increased amount of trade school intakes I was witnessed, there will more and more apprentice/students looking to get a little helping hand."
        ]
    },
    {
        "title": "Where?",
        "statements": [
            "I can drive to your location given it be within a 30-45 minute radius drive from London, Ontario.",
            "We can meet at a library"
        ]
    },
    {
        "title": "When?",
        "statements": ["Upon Request. We can connect and then find a time which works best for you."]
    },
    {
        "title": "Price?",
        "statements": ["$25 / Hour"]
    }
]